# 將數據轉換為資料框
data <- data.frame(
  國家 = c("香港", "澳門", "大陸", "日本", "韓國", "新加坡", "馬來西亞", "泰國", "菲律賓", "印尼", "汶淶", "越南", "緬甸", "柬埔寨", "阿拉伯聯合大公國", "土耳其", "亞洲其他地區", "亞洲合計", "美國", "加拿大", "美洲其他地區", "美洲合計", "法國", "德國", "義大利", "荷蘭", "瑞士", "英國", "奧地利", "歐洲其他地區", "歐洲合計", "澳大利亞", "紐西蘭", "帛琉", "大洋洲其他地區", "大洋洲合計", "南非", "非洲其他地區", "非洲合計", "其他", "總計"),
  男生 = c(371254, 151509, 1039893, 1840780, 314240, 141130, 115490, 371310, 108378, 60161, 2689, 431997, 4630, 28698, 49053, 30536, 1506, 5063254, 216960, 32417, 99, 249476, 23786, 36034, 20072, 11637, 179, 11019, 21994, 4033, 128754, 53773, 11666, 5327, 68, 70834, 39, 137, 176, 9217, 5521711),
  女生 = c(372189, 124470, 721241, 2385024, 640453, 175585, 129646, 406016, 100021, 65738, 4132, 421862, 3289, 17352, 72714, 47750, 1578, 5689060, 248796, 45106, 85, 293987, 35827, 42938, 29832, 15548, 236, 18344, 33566, 5996, 182287, 76503, 16931, 5228, 14, 98676, 45, 119, 164, 9949, 6274123)
)

# 移除總計列
data <- data[-nrow(data),]

# 移除包含 "亞洲" 的行
data <- subset(data, !grepl("亞洲", 國家))


# 將資料框轉換為長格式
library(reshape2)
data_long <- melt(data, id.vars = "國家", variable.name = "性別", value.name = "人口數")



# 繪製群組長條圖
library(ggplot2)
ggplot(data_long, aes(x = 國家, y = 人口數, fill = 性別)) +
  geom_bar(stat = "identity", position = "dodge") +
  theme_minimal() +
  theme(axis.text.x = element_text(angle = 45, hjust = 1)) +
  labs(title = "各國男女人口數", x = "國家", y = "人口數", fill = "性別")
